<!DOCTYPE html>
<html lang="de">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="general.css">
    <script>
        window.onload = () => {
            let id = window.top.location.pathname;
            document.getElementById('datalink').href = '/data' + id;
        }
    </script>
    <title>Info</title>
</head>
<body>
    <h1>Info</h1>
    <h3>Zu erst einmal... Danke!</h3>
    <p>... dass Du dieses Tool nutzt. Dann war der Programmieraufwand wenigstens nicht umsonst.</p>
    <h3>Was ist das hier?</h3>
    <p>MobiMonitor ist eine kleines Tool, mit welchem sich im VVO-Gebiet f&uuml;r eine Vorauswahl von Haltestellen alle Abfahrten &uuml;bersichtlich anzeigen lassen.</p>
    <p>Du steigst immer an derselben Haltestelle ein, aber kannst Dir den Fahrplan trotzdem nicht merken? Kein Problem, MobiMonitor &uuml;bernimmt das f&uuml;r Dich. Versp&auml;tungen sind auch gleich mit einberechnet ;)</p>
    <p>Speicher einfach Deine Wunschstationen in Deinem personalisierten MobiMonitor ab und hab immer alles auf einen Blick parat.</p>
    <h3>Ist das zuverl&auml;ssig?</h3>
    <p>Die Daten kommen direkt der VVO-Web-API und werden aller 15 Sekunden aktualisiert. Demnach ist die Sache ziemlich wasserfest.</p>
    <p>Unter Umst&auml;nden beachtet das Tool jedoch noch nicht, ob Fahrten ausfallen. Das wird sich allerdings noch &auml;ndern.</p>
    <p>Bitte beachte zus&auml;tzlich, dass pro Station nur die Abfahrten der von dir gew&auml;hlten Linien betrachtet werden, sofern sie innerhalb der n&auml;chsten 60 Minuten stattfinden.</p>
    <h3>Ganz wichtig!</h3>
    <p>Bitte beachte, dass jeder, der den Link zu deinem MobiMonitor hat, dort auch alles lesen und &auml;ndern kann.</p>
    <p>Dementsprechend solltest Du Deinen pers&ouml;nlichen Link geheimhalten, MobiMonitor nur auf privaten Ger&auml;ten nutzen oder zumindest Deinen Browserverlauf nachher l&ouml;schen.</p>
    <p>Ferner solltest Du beachten, dass Dein MobiMonitor gel&ouml;scht wird, wenn Du ihn l&auml;nger als 2 Wochen nicht genutzt hast.</p>
    <h3>Gibt's das auch als App?</h3>
    <p>Du kannst Deinen MobiMonitor auf Deinen Home-Bildschirm laden - dann funktioniert sie genau so wie eine App!</p>
    <p>Du wei&szlig;t nicht, wie das geht? Das erf&auml;hrst du <a href="https://support.apple.com/de-de/guide/iphone/iph42ab2f3a7/ios#iph4f9a47bbc" target="_blank">hier (iOS)</a> bzw. <a href="http://mzl.la/1ApHClH" target="_blank">hier (Android)</a>.</p>
    <h3>Datenschutz!?!</h3>
    <p>Cookies? Wer braucht das schon. Wir speichern nur die von Dir get&auml;tigten Einstellungen - und sonst nichts! Keine personenbezogenen Daten!</p>
    <p>Wenn du genau wissen willst, was wir &uuml;ber Dich wissen, kannst Du Dir <a id="datalink">hier</a> eine JSON-Datei davon runterladen.</p>
    <p>&Ouml;ffne die Datei mit einem Texteditor deines Vertrauens, f&uuml;ge den Inhalt der Datei einfach in <a href="https://jsonformatter.curiousconcept.com/" target="_blank">diesem Tool</a> ein und schon wird alles lesbar!</p>
    <h3>Dieser #*%!$ funktioniert nicht!</h3>
    <p>Ziehe bitte in Betracht, dass das Tool von einer Person auf die Beine gestellt wurde. Bugs sind damit vorprogrammiert - wortw&ouml;rtlich.</p>
    <p>Aber wenn Dir ein Fehler auff&auml;llt, dann lass es doch einfach den Entwickler wissen, damit er sich darum k&uuml;mmern kann ;)</p>
</body>
</html>